# Team 2 - NYC Airbnb - NYC Property Sale

![](https://img4.cityrealty.com/neo/i/p/mig/airbnb_guide.jpg)

_For more information about the dataset, read [here](https://www.kaggle.com/new-york-city/nyc-property-sales)._

In [0]:
# Start your codes here!
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

import warnings
warnings.filterwarnings('ignore')

sns.set_style("whitegrid")

In [69]:
from google.colab import drive
drive.mount('/content/gdrive')

Drive already mounted at /content/gdrive; to attempt to forcibly remount, call drive.mount("/content/gdrive", force_remount=True).

In [0]:
df = pd.read_csv('/content/gdrive/My Drive/nyc-property-sales.csv')

#Data overview

In [88]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 54388 entries, 0 to 84545
Data columns (total 3 columns):
NEIBORHOOD GROUP    54388 non-null object
CLASS               54388 non-null object
SALE PRICE          54388 non-null int64
dtypes: int64(1), object(2)
memory usage: 1.7+ MB

In [91]:
df.describe()

         SALE PRICE
count  5.438800e+04
mean   1.125377e+06
std    2.765326e+06
min    1.110000e+03
25%    3.800000e+05
50%    6.230000e+05
75%    9.990000e+05
max    2.175000e+08

In [85]:
df.sample(5)

      NEIBORHOOD GROUP CLASS  SALE PRICE
37847         Brooklyn     A      389153
15694        Manhattan     R     2245000
3499         Manhattan     R      515000
55690           Queens     C      450000
56527           Queens     A      670000

# Drop the properties those price smaller than 1000$

In [0]:
df.drop(labels=df[df['SALE PRICE'].str.contains('-')].index,axis=0,inplace=True)

In [0]:
df['SALE PRICE'] = df['SALE PRICE'].astype('int64')
df = df[df['SALE PRICE']>1000]

#Drop the propertise have commercial units

In [0]:
df = df[df['COMMERCIAL UNITS']==0]

# Replace Borough code with Text

In [0]:
def replace(borough):
    switcher = { 
        1: "Manhattan", 
        2: "Bronx", 
        3: "Brooklyn", 
        4: "Queens",
        5: "Staten Island"
    } 
    return switcher.get(borough, "Other")

In [0]:
df['NEIBORHOOD GROUP'] = df['BOROUGH'].apply(replace)

# Drop the properties except class A, B, C, D, R

In [0]:
df['CLASS'] = df['BUILDING CLASS AT PRESENT'].str[0]

In [0]:
df = df[df['CLASS'].isin(['A','B','C','D','R'])]

#Get the final result to csv

In [0]:
df = df[['NEIBORHOOD GROUP','CLASS','SALE PRICE']]

In [86]:
df.sample(5)

      NEIBORHOOD GROUP CLASS  SALE PRICE
17428        Manhattan     R    12147722
79719    Staten Island     B      357000
82711    Staten Island     A      230000
30704         Brooklyn     C     4600000
60595           Queens     D      245000

In [0]:
df.to_csv('/content/gdrive/My Drive/nyc-rolling-sales-cleaned.csv')